/* 
Допуск студента до іспиту
Є три умови:
- студент набрав 60 або більше балів;
- відвідуваність 80% або більше;
- усі лабораторні роботи здані.
Потрібно визначити статус студента:
- якщо виконані всі 3 умови → "Допущено до іспиту без зауважень";
- якщо виконані умови по балах і відвідуваності → "Допущено, але потрібно здати лабораторні";
- якщо виконана тільки умова по балах → "Потрібно покращити відвідуваність і здати лабораторні";
- в інших випадках → "Не допущено до іспиту".
*/

let score = 60;
let attendance = 15;
let labsCompleted = false;

if (score >= 60 && attendance >= 80 && labsCompleted) {
  console.log("Допущено до іспиту без зауважень");
} else if (score >= 60 && attendance >= 80) {
  console.log("Допущено, але потрібно здати лабораторні");
} else if (score >= 60) {
  console.log("Потрібно покращити відвідуваність і здати лабораторні");
} else {
  console.log("Не допущено до іспиту");
}